// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

Console.WriteLine("Start");

int number A = Console.ReadLine();
int number B = Console.ReadLine();

if A > B {
    (Max = A Min = B);
}
else B > A {
    (Max = B Min = A);
}
Console.WriteLine(Max, Min);
